x1 = int(input("Введите координаты X первой точки: "))
y1 = int(input("Введите координаты Y первой точки: "))
x2 = int(input("Введите координаты X второй точки: "))
y2 = int(input("Введите координаты Y второй точки: "))
x3 = int(input("Введите координаты X третьей точки: "))
y3 = int(input("Введите координаты Y третьей точки: "))
x4 = int
y4 = int
if x1 == x2:
    x4 = x3
elif x1 == x3:
    x4 = x2
elif x2==x3:
    x4=x1
if y1 == y2:
    y4 = y3
elif y1 == y3:
    y4 = y2
elif y2==y3:
    y4=y1
print("Координаы четвертой вершины: ","(",x4,";",y4,")")
